android/12.Video4Linux/01.driver/01.Video4Linux基础.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-14 二 14:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="wildbook" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. 简介</a>
<ul>
<li><a href="#orgheadline1">1.1. V4L2支持的设备接口</a></li>
<li><a href="#orgheadline2">1.2. 参考文档</a></li>
</ul>
</li>
<li><a href="#orgheadline4">2. sysfs</a></li>
<li><a href="#orgheadline10">3. 数据结构</a>
<ul>
<li><a href="#orgheadline5">3.1. v4l2<sub>device</sub></a></li>
<li><a href="#orgheadline6">3.2. v4l2<sub>subdev</sub></a></li>
<li><a href="#orgheadline7">3.3. v4l2<sub>fh</sub></a></li>
<li><a href="#orgheadline8">3.4. video<sub>buf</sub></a></li>
<li><a href="#orgheadline9">3.5. video<sub>device</sub></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
V4L2是V4L的第二个版本
</p>
</div>
<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> V4L2支持的设备接口</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>视频采集接口</b> (video capture interface)
<b>视频输出接口</b> (video output interface)
<b>视频间隔消隐信号接口</b> (VBI interface)
<b>收音机接口</b> (radio interface)
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 参考文档</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><b>Docs</b>
Documentation/video4linux/V4L2-framework.txt
Documentation/video4linux/videobuf</li>
<li><b>Code</b>
     drivers/media/video目录下核心代码</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> sysfs</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>子设备用户空间API
<b>/dev/v4l-subdevX</b>
<b>/dev/fbX</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">3</span> 数据结构</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.1</span> v4l2<sub>device</sub></h3>
<div class="outline-text-3" id="text-3-1">
<p>
用于保存设备实例的数据
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">video_device</span>
 {
<span style="color: #268bd2;"> #if</span> <span style="color: #268bd2;">defined</span>(CONFIG_MEDIA_CONTROLLER)
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">media_entity</span> <span style="color: #268bd2;">entity</span>;
<span style="color: #268bd2;"> #endif</span>
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">device ops */</span>
   <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">v4l2_file_operations</span> *<span style="color: #268bd2;">fops</span>;

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">sysfs */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device</span> <span style="color: #268bd2;">dev</span>;    <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">v4l device */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">cdev</span> *<span style="color: #268bd2;">cdev</span>;    <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">character device */</span>

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Set either parent or v4l2_dev if your driver uses v4l2_device */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device</span> *<span style="color: #268bd2;">parent</span>;    <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">device parent */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">v4l2_device</span> *<span style="color: #268bd2;">v4l2_dev</span>; <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">v4l2_device parent */</span>

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Control handler associated with this device node. May be NULL. */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">v4l2_ctrl_handler</span> *<span style="color: #268bd2;">ctrl_handler</span>;

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">vb2_queue associated with this device node. May be NULL. */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">vb2_queue</span> *<span style="color: #268bd2;">queue</span>;

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Priority state. If NULL, then v4l2_dev-&gt;prio will be used. */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">v4l2_prio_state</span> *<span style="color: #268bd2;">prio</span>;

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">device info */</span>
   <span style="color: #b58900;">char</span> <span style="color: #268bd2;">name</span>[<span style="color: #6c71c4;">32</span>];
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">vfl_type</span>; <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">device type */</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">vfl_dir</span>;  <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">receiver, transmitter or m2m */</span>
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">'minor' is set to -1 if the registration failed */</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">minor</span>;
   <span style="color: #b58900;">u16</span> <span style="color: #268bd2;">num</span>;
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">use bitops to set/clear/test flags */</span>
   <span style="color: #b58900;">unsigned</span> <span style="color: #b58900;">long</span> <span style="color: #268bd2;">flags</span>;
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">attribute to differentiate multiple indices on one physical device */</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">index</span>;

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">V4L2 file handles */</span>
   <span style="color: #b58900;">spinlock_t</span>    <span style="color: #268bd2;">fh_lock</span>; <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Lock for all v4l2_fhs */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">list_head</span>  <span style="color: #268bd2;">fh_list</span>; <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">List of struct v4l2_fh */</span>

   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">debug</span>;      <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Activates debug level*/</span>

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Video standard vars */</span>
   <span style="color: #b58900;">v4l2_std_id</span> <span style="color: #268bd2;">tvnorms</span>;    <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Supported tv norms */</span>
   <span style="color: #b58900;">v4l2_std_id</span> <span style="color: #268bd2;">current_norm</span>; <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Current tvnorm */</span>

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">callbacks */</span>
   <span style="color: #b58900;">void</span> (*<span style="color: #268bd2;">release</span>)(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">video_device</span> *<span style="color: #268bd2;">vdev</span>);

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">ioctl callbacks */</span>
   <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">v4l2_ioctl_ops</span> *<span style="color: #268bd2;">ioctl_ops</span>;
   DECLARE_BITMAP(valid_ioctls, BASE_VIDIOC_PRIVATE);

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">serialization lock */</span>
   DECLARE_BITMAP(disable_locking, BASE_VIDIOC_PRIVATE);
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">mutex</span> *<span style="color: #268bd2;">lock</span>;
 };
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">3.2</span> v4l2<sub>subdev</sub></h3>
<div class="outline-text-3" id="text-3-2">
<p>
代表子设备实例
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.3</span> v4l2<sub>fh</sub></h3>
<div class="outline-text-3" id="text-3-3">
<p>
跟踪文件句柄实例
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.4</span> video<sub>buf</sub></h3>
<div class="outline-text-3" id="text-3-4">
<p>
处理视频缓冲
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">3.5</span> video<sub>device</sub></h3>
<div class="outline-text-3" id="text-3-5">
<p>
结构体保存V4L2设备节点的数据
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: wildbook</p>
<p class="date">Created: 2017-02-14 二 14:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
